In [1]:
import pandas as pd

import lynx as lx

In [2]:
ratings = pd.DataFrame(
    [
        ["Alice", "TI", 5, "2012-09-01"],
        ["Alice", "NH", 3, "2012-09-12"],
        ["Alice", "SW", 1, "2012-09-15"],
        ["Bob", "SW", 4, "2012-09-02"],
        ["Bob", "ST", 5, "2012-10-07"],
        ["Charlie", "TI", 1, "2012-09-05"],
        ["Charlie", "SW", 1, "2012-09-05"],
    ],
    columns=["user_id", "movie_id", "score", "date"]
)
ratings

   user_id movie_id  score        date
0    Alice       TI      5  2012-09-01
1    Alice       NH      3  2012-09-12
2    Alice       SW      1  2012-09-15
3      Bob       SW      4  2012-09-02
4      Bob       ST      5  2012-10-07
5  Charlie       TI      1  2012-09-05
6  Charlie       SW      1  2012-09-05

In [3]:
users = pd.DataFrame(
    [
        ["Alice", "F", 30],
        ["Bob", "M", 25],
        ["Charlie", "M", 28]
    ],
    columns=["id", "gender", "age"]
)
users

        id gender  age
0    Alice      F   30
1      Bob      M   25
2  Charlie      M   28

In [4]:
movies = pd.DataFrame(
    [
        ["TI", "Action"],
        ["TI", "Romance"],
        ["SW", "Science Fiction"],
        ["ST", "Science Fiction"],
        ["NH", "Romance"],
        ["NH", "Comedy"]
    ],
    columns=["id", "genre"]
)
movies

   id            genre
0  TI           Action
1  TI          Romance
2  SW  Science Fiction
3  ST  Science Fiction
4  NH         Thriller

In [5]:
friends = pd.DataFrame(
    [
        ["Alice", "Charlie"],
        ["Bob", "Charlie"],
        ["Charlie", "Alice"],
        ["Charlie", "Bob"]
    ],
    columns=["user_id", "friend_id"]
)
friends

   user_id friend_id
0    Alice   Charlie
1      Bob   Charlie
2  Charlie     Alice
3  Charlie       Bob

In [14]:
agg_movies = movies.groupby("id").aggregate(lambda x: list(x)).reset_index()
movies_table = lx.Table(agg_movies, "movies").explode("genre")
movies_table.to_dataframe()

   id  0  1  2  3
0  NH  0  0  0  1
1  ST  0  0  1  0
2  SW  0  0  1  0
3  TI  1  1  0  0